In [9]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 2, 3])

In [3]:
s

0    1
1    2
2    3
dtype: int64

In [4]:
s.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

In [5]:
s = pd.Series(['a', 'a', 'b', 'c'])

In [6]:
s

0    a
1    a
2    b
3    c
dtype: object

In [7]:
s.describe()

count     4
unique    3
top       a
freq      2
dtype: object

In [10]:
s = pd.Series([
  np.datetime64("2000-01-01"),
  np.datetime64("2010-01-01"),
  np.datetime64("2010-01-01")
])

In [11]:
s

0   2000-01-01
1   2010-01-01
2   2010-01-01
dtype: datetime64[ns]

In [12]:
s.describe(datetime_is_numeric=True)

count                      3
mean     2006-09-01 08:00:00
min      2000-01-01 00:00:00
25%      2004-12-31 12:00:00
50%      2010-01-01 00:00:00
75%      2010-01-01 00:00:00
max      2010-01-01 00:00:00
dtype: object

In [13]:
s.describe(datetime_is_numeric=False)

C:\Users\User\AppData\Local\Temp\ipykernel_8336\3589270418.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  s.describe(datetime_is_numeric=False)

count                       3
unique                      2
top       2010-01-01 00:00:00
freq                        2
first     2000-01-01 00:00:00
last      2010-01-01 00:00:00
dtype: object

In [14]:
df = pd.DataFrame({'categorical': pd.Categorical(['d','e','f']),
                   'numeric': [1, 2, 3],
                   'object': ['a', 'b', 'c']
                  })

In [15]:
df

  categorical  numeric object
0           d        1      a
1           e        2      b
2           f        3      c

In [16]:
df.describe()

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [17]:
df.describe(include='all')

       categorical  numeric object
count            3      3.0      3
unique           3      NaN      3
top              d      NaN      a
freq             1      NaN      1
mean           NaN      2.0    NaN
std            NaN      1.0    NaN
min            NaN      1.0    NaN
25%            NaN      1.5    NaN
50%            NaN      2.0    NaN
75%            NaN      2.5    NaN
max            NaN      3.0    NaN

In [18]:
df.numeric.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: numeric, dtype: float64

In [19]:
df.describe(include=[np.number])

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [20]:
df.describe(include=[object])

       object
count       3
unique      3
top         a
freq        1

In [21]:
df.describe(include=['category'])

       categorical
count            3
unique           3
top              d
freq             1

In [22]:
df.describe(exclude=[np.number])

       categorical object
count            3      3
unique           3      3
top              d      a
freq             1      1

In [23]:
df.describe(exclude=[object])

       categorical  numeric
count            3      3.0
unique           3      NaN
top              d      NaN
freq             1      NaN
mean           NaN      2.0
std            NaN      1.0
min            NaN      1.0
25%            NaN      1.5
50%            NaN      2.0
75%            NaN      2.5
max            NaN      3.0